queens_aaa_workflow/openfoam_cases/case_000/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; 	// [kg m s ... ]

internalField   uniform (0 0 0);

boundaryField
{

inlet
{
  type uniformFixedValue;
  uniformValue table
  (  (0.0236 (-0.0001 0.0014 -0.0000))
  (0.0359 (-0.0008 0.0205 -0.0000))
  (0.0449 (-0.0023 0.0575 -0.0000))
  (0.0504 (-0.0036 0.0901 -0.0000))
  (0.0544 (-0.0047 0.1169 -0.0000))
  (0.0577 (-0.0059 0.1483 -0.0000))
  (0.0601 (-0.0069 0.1732 -0.0000))
  (0.0644 (-0.0079 0.1988 -0.0000))
  (0.0671 (-0.0090 0.2254 -0.0000))
  (0.0729 (-0.0103 0.2572 -0.0000))
  (0.0816 (-0.0115 0.2877 -0.0000))
  (0.0886 (-0.0127 0.3176 -0.0000))
  (0.0946 (-0.0137 0.3432 -0.0000))
  (0.1018 (-0.0149 0.3723 -0.0000))
  (0.1090 (-0.0159 0.3979 -0.0000))
  (0.1184 (-0.0169 0.4242 -0.0000))
  (0.1375 (-0.0180 0.4503 -0.0000))
  (0.1673 (-0.0174 0.4358 -0.0000))
  (0.1800 (-0.0167 0.4187 -0.0000))
  (0.1945 (-0.0158 0.3963 -0.0000))
  (0.2077 (-0.0149 0.3721 -0.0000))
  (0.2186 (-0.0140 0.3501 -0.0000))
  (0.2282 (-0.0131 0.3289 -0.0000))
  (0.2378 (-0.0123 0.3072 -0.0000))
  (0.2477 (-0.0111 0.2781 -0.0000))
  (0.2631 (-0.0099 0.2469 -0.0000))
  (0.2701 (-0.0090 0.2255 -0.0000))
  (0.2817 (-0.0078 0.1948 -0.0000))
  (0.2920 (-0.0065 0.1641 -0.0000))
  (0.2992 (-0.0054 0.1359 -0.0000))
  (0.3064 (-0.0043 0.1087 -0.0000))
  (0.3137 (-0.0032 0.0806 -0.0000))
  (0.3209 (-0.0021 0.0531 -0.0000))
  (0.3269 (-0.0012 0.0313 -0.0000))
  (0.3373 (-0.0001 0.0020 -0.0000))
  (0.3474 (0.0014 -0.0347 0.0000))
  (0.3546 (0.0023 -0.0576 0.0000))
  (0.3618 (0.0032 -0.0808 0.0000))
  (0.3702 (0.0043 -0.1069 0.0000))
  (0.3816 (0.0053 -0.1321 0.0000))
  (0.3989 (0.0060 -0.1516 0.0000))
  (0.4316 (0.0057 -0.1439 0.0000))
  (0.4594 (0.0052 -0.1312 0.0000))
  (0.4822 (0.0046 -0.1151 0.0000))
  (0.5075 (0.0038 -0.0946 0.0000))
  (0.5303 (0.0030 -0.0743 0.0000))
  (0.5532 (0.0021 -0.0533 0.0000))
  (0.5785 (0.0012 -0.0311 0.0000))
  (0.6050 (0.0004 -0.0095 0.0000))
  (0.6275 (-0.0003 0.0069 -0.0000))
  (0.6580 (-0.0010 0.0238 -0.0000))
  (0.6854 (-0.0011 0.0285 -0.0000))
  (0.7109 (-0.0011 0.0267 -0.0000))
  (0.7374 (-0.0010 0.0255 -0.0000))
  (0.7639 (-0.0008 0.0212 -0.0000))
  (0.7904 (-0.0006 0.0161 -0.0000))
  (0.8169 (-0.0004 0.0100 -0.0000))
  (0.8482 (-0.0001 0.0034 -0.0000))
  (0.8746 (0.0001 -0.0028 0.0000))
  (0.9011 (0.0002 -0.0043 0.0000))
  (0.9276 (0.0002 -0.0044 0.0000))
  (0.9513 (-0.0001 0.0014 -0.0000))
  (0.9749 (-0.0001 0.0014 -0.0000))
  (0.9872 (-0.0008 0.0205 -0.0000))
  (0.9962 (-0.0023 0.0575 -0.0000))
  (1.0017 (-0.0036 0.0901 -0.0000))
  (1.0057 (-0.0047 0.1169 -0.0000))
  (1.0090 (-0.0059 0.1483 -0.0000))
  (1.0114 (-0.0069 0.1732 -0.0000))
  (1.0157 (-0.0079 0.1988 -0.0000))
  (1.0184 (-0.0090 0.2254 -0.0000))
  (1.0242 (-0.0103 0.2572 -0.0000))
  (1.0329 (-0.0115 0.2877 -0.0000))
  (1.0398 (-0.0127 0.3176 -0.0000))
  (1.0459 (-0.0137 0.3432 -0.0000))
  (1.0531 (-0.0149 0.3723 -0.0000))
  (1.0603 (-0.0159 0.3979 -0.0000))
  (1.0697 (-0.0169 0.4242 -0.0000))
  (1.0888 (-0.0180 0.4503 -0.0000))
  (1.1186 (-0.0174 0.4358 -0.0000))
  (1.1313 (-0.0167 0.4187 -0.0000))
  (1.1458 (-0.0158 0.3963 -0.0000))
  (1.1590 (-0.0149 0.3721 -0.0000))
  (1.1699 (-0.0140 0.3501 -0.0000))
  (1.1795 (-0.0131 0.3289 -0.0000))
  (1.1891 (-0.0123 0.3072 -0.0000))
  (1.1990 (-0.0111 0.2781 -0.0000))
  (1.2144 (-0.0099 0.2469 -0.0000))
  (1.2214 (-0.0090 0.2255 -0.0000))
  (1.2330 (-0.0078 0.1948 -0.0000))
  (1.2433 (-0.0065 0.1641 -0.0000))
  (1.2505 (-0.0054 0.1359 -0.0000))
  (1.2577 (-0.0043 0.1087 -0.0000))
  (1.2650 (-0.0032 0.0806 -0.0000))
  (1.2722 (-0.0021 0.0531 -0.0000))
  (1.2782 (-0.0012 0.0313 -0.0000))
  (1.2886 (-0.0001 0.0020 -0.0000))
  (1.2987 (0.0014 -0.0347 0.0000))
  (1.3059 (0.0023 -0.0576 0.0000))
  (1.3131 (0.0032 -0.0808 0.0000))
  (1.3215 (0.0043 -0.1069 0.0000))
  (1.3329 (0.0053 -0.1321 0.0000))
  (1.3502 (0.0060 -0.1516 0.0000))
  (1.3829 (0.0057 -0.1439 0.0000))
  (1.4107 (0.0052 -0.1312 0.0000))
  (1.4335 (0.0046 -0.1151 0.0000))
  (1.4588 (0.0038 -0.0946 0.0000))
  (1.4816 (0.0030 -0.0743 0.0000))
  (1.5045 (0.0021 -0.0533 0.0000))
  (1.5298 (0.0012 -0.0311 0.0000))
  (1.5563 (0.0004 -0.0095 0.0000))
  (1.5788 (-0.0003 0.0069 -0.0000))
  (1.6093 (-0.0010 0.0238 -0.0000))
  (1.6367 (-0.0011 0.0285 -0.0000))
  (1.6622 (-0.0011 0.0267 -0.0000))
  (1.6887 (-0.0010 0.0255 -0.0000))
  (1.7152 (-0.0008 0.0212 -0.0000))
  (1.7417 (-0.0006 0.0161 -0.0000))
  (1.7682 (-0.0004 0.0100 -0.0000))
  (1.7995 (-0.0001 0.0034 -0.0000))
  (1.8259 (0.0001 -0.0028 0.0000))
  (1.8524 (0.0002 -0.0043 0.0000))
  (1.8789 (0.0002 -0.0044 0.0000))
  (1.9026 (-0.0001 0.0014 -0.0000))
  (1.9262 (-0.0001 0.0014 -0.0000))
  (1.9385 (-0.0008 0.0205 -0.0000))
  (1.9475 (-0.0023 0.0575 -0.0000))
  (1.9530 (-0.0036 0.0901 -0.0000))
  (1.9570 (-0.0047 0.1169 -0.0000))
  (1.9603 (-0.0059 0.1483 -0.0000))
  (1.9627 (-0.0069 0.1732 -0.0000))
  (1.9670 (-0.0079 0.1988 -0.0000))
  (1.9697 (-0.0090 0.2254 -0.0000))
  (1.9755 (-0.0103 0.2572 -0.0000))
  (1.9842 (-0.0115 0.2877 -0.0000))
  (1.9911 (-0.0127 0.3176 -0.0000))
  (1.9972 (-0.0137 0.3432 -0.0000))
  (2.0044 (-0.0149 0.3723 -0.0000))
  (2.0116 (-0.0159 0.3979 -0.0000))
  (2.0210 (-0.0169 0.4242 -0.0000))
  (2.0401 (-0.0180 0.4503 -0.0000))
  (2.0699 (-0.0174 0.4358 -0.0000))
  (2.0826 (-0.0167 0.4187 -0.0000))
  (2.0971 (-0.0158 0.3963 -0.0000))
  (2.1103 (-0.0149 0.3721 -0.0000))
  (2.1212 (-0.0140 0.3501 -0.0000))
  (2.1308 (-0.0131 0.3289 -0.0000))
  (2.1404 (-0.0123 0.3072 -0.0000))
  (2.1503 (-0.0111 0.2781 -0.0000))
  (2.1657 (-0.0099 0.2469 -0.0000))
  (2.1727 (-0.0090 0.2255 -0.0000))
  (2.1843 (-0.0078 0.1948 -0.0000))
  (2.1946 (-0.0065 0.1641 -0.0000))
  (2.2018 (-0.0054 0.1359 -0.0000))
  (2.2090 (-0.0043 0.1087 -0.0000))
  (2.2163 (-0.0032 0.0806 -0.0000))
  (2.2235 (-0.0021 0.0531 -0.0000))
  (2.2295 (-0.0012 0.0313 -0.0000))
  (2.2399 (-0.0001 0.0020 -0.0000))
  (2.2500 (0.0014 -0.0347 0.0000))
  (2.2572 (0.0023 -0.0576 0.0000))
  (2.2644 (0.0032 -0.0808 0.0000))
  (2.2728 (0.0043 -0.1069 0.0000))
  (2.2842 (0.0053 -0.1321 0.0000))
  (2.3015 (0.0060 -0.1516 0.0000))
  (2.3342 (0.0057 -0.1439 0.0000))
  (2.3620 (0.0052 -0.1312 0.0000))
  (2.3848 (0.0046 -0.1151 0.0000))
  (2.4101 (0.0038 -0.0946 0.0000))
  (2.4329 (0.0030 -0.0743 0.0000))
  (2.4558 (0.0021 -0.0533 0.0000))
  (2.4811 (0.0012 -0.0311 0.0000))
  (2.5076 (0.0004 -0.0095 0.0000))
  (2.5301 (-0.0003 0.0069 -0.0000))
  (2.5606 (-0.0010 0.0238 -0.0000))
  (2.5880 (-0.0011 0.0285 -0.0000))
  (2.6135 (-0.0011 0.0267 -0.0000))
  (2.6400 (-0.0010 0.0255 -0.0000))
  (2.6665 (-0.0008 0.0212 -0.0000))
  (2.6930 (-0.0006 0.0161 -0.0000))
  (2.7195 (-0.0004 0.0100 -0.0000))
  (2.7508 (-0.0001 0.0034 -0.0000))
  (2.7772 (0.0001 -0.0028 0.0000))
  (2.8037 (0.0002 -0.0043 0.0000))
  (2.8302 (0.0002 -0.0044 0.0000))
  (2.8539 (-0.0001 0.0014 -0.0000))
  (2.8775 (-0.0001 0.0014 -0.0000))
  (2.8898 (-0.0008 0.0205 -0.0000))
  (2.8988 (-0.0023 0.0575 -0.0000))
  (2.9043 (-0.0036 0.0901 -0.0000))
  (2.9083 (-0.0047 0.1169 -0.0000))
  (2.9116 (-0.0059 0.1483 -0.0000))
  (2.9140 (-0.0069 0.1732 -0.0000))
  (2.9183 (-0.0079 0.1988 -0.0000))
  (2.9210 (-0.0090 0.2254 -0.0000))
  (2.9268 (-0.0103 0.2572 -0.0000))
  (2.9355 (-0.0115 0.2877 -0.0000))
  (2.9425 (-0.0127 0.3176 -0.0000))
  (2.9485 (-0.0137 0.3432 -0.0000))
  (2.9557 (-0.0149 0.3723 -0.0000))
  (2.9629 (-0.0159 0.3979 -0.0000))
  (2.9723 (-0.0169 0.4242 -0.0000))
  (2.9914 (-0.0180 0.4503 -0.0000))
  (3.0212 (-0.0174 0.4358 -0.0000))
  (3.0339 (-0.0167 0.4187 -0.0000))
  (3.0484 (-0.0158 0.3963 -0.0000))
  (3.0616 (-0.0149 0.3721 -0.0000))
  (3.0725 (-0.0140 0.3501 -0.0000))
  (3.0821 (-0.0131 0.3289 -0.0000))
  (3.0917 (-0.0123 0.3072 -0.0000))
  (3.1016 (-0.0111 0.2781 -0.0000))
  (3.1170 (-0.0099 0.2469 -0.0000))
  (3.1240 (-0.0090 0.2255 -0.0000))
  (3.1356 (-0.0078 0.1948 -0.0000))
  (3.1459 (-0.0065 0.1641 -0.0000))
  (3.1531 (-0.0054 0.1359 -0.0000))
  (3.1603 (-0.0043 0.1087 -0.0000))
  (3.1676 (-0.0032 0.0806 -0.0000))
  (3.1748 (-0.0021 0.0531 -0.0000))
  (3.1808 (-0.0012 0.0313 -0.0000))
  (3.1912 (-0.0001 0.0020 -0.0000))
  (3.2013 (0.0014 -0.0347 0.0000))
  (3.2085 (0.0023 -0.0576 0.0000))
  (3.2157 (0.0032 -0.0808 0.0000))
  (3.2241 (0.0043 -0.1069 0.0000))
  (3.2355 (0.0053 -0.1321 0.0000))
  (3.2528 (0.0060 -0.1516 0.0000))
  (3.2855 (0.0057 -0.1439 0.0000))
  (3.3133 (0.0052 -0.1312 0.0000))
  (3.3361 (0.0046 -0.1151 0.0000))
  (3.3614 (0.0038 -0.0946 0.0000))
  (3.3842 (0.0030 -0.0743 0.0000))
  (3.4071 (0.0021 -0.0533 0.0000))
  (3.4324 (0.0012 -0.0311 0.0000))
  (3.4589 (0.0004 -0.0095 0.0000))
  (3.4814 (-0.0003 0.0069 -0.0000))
  (3.5119 (-0.0010 0.0238 -0.0000))
  (3.5393 (-0.0011 0.0285 -0.0000))
  (3.5648 (-0.0011 0.0267 -0.0000))
  (3.5913 (-0.0010 0.0255 -0.0000))
  (3.6178 (-0.0008 0.0212 -0.0000))
  (3.6443 (-0.0006 0.0161 -0.0000))
  (3.6708 (-0.0004 0.0100 -0.0000))
  (3.7021 (-0.0001 0.0034 -0.0000))
  (3.7285 (0.0001 -0.0028 0.0000))
  (3.7550 (0.0002 -0.0043 0.0000))
  (3.7815 (0.0002 -0.0044 0.0000))
  (3.8052 (-0.0001 0.0014 -0.0000))
  );
}

outlet
{
    type        inletOutlet;
    inletValue  uniform (0 0 0);
    value       $internalField;
}

wall
{
type        noSlip;
} 

}

// ************************************************************************* //