queens_aaa_workflow/openfoam_cases/case_000/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-37.002183 -25.434797 -56.156933)
    (75.195009 -25.434797 -56.156933)
    (75.195009 155.234199 -56.156933)
    (-37.002183 155.234199 -56.156933)
    (-37.002183 -25.434797 56.156933)
    (75.195009 -25.434797 56.156933)
    (75.195009 155.234199 56.156933)
    (-37.002183 155.234199 56.156933)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (225 362 225) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
